{
    "shoe.txt": {
        "type": "file",
        "path": "TestDirectory3/shoe.txt",
        "data": 1,
        "summary": "The text you asked about is quite comprehensive! It tells us that shoes, primarily designed to shield and offer comfort for human feet, have evolved into various forms catering to different needs. From simple, cost-effective sandals to high-end fashion creations by renowned designers, the world of shoes is vast and varied. Not only do they ramp up the style quotient, but different footwear also serves specific roles, such as steel-toe boots for worker safety, or specific boots for activities like mountaineering or skiing."
    },
    "tv.txt": {
        "type": "file",
        "path": "TestDirectory3/tv.txt",
        "data": 1,
        "summary": "The file describes the evolution of television, a telecommunication medium designed for transmitting moving images and sound. From its inception as a crude experimental medium in the 1920s to gaining popularity in the post-World War II era with black-and-white broadcasting in UK and US, television became a conduit for advertising, entertainment, news, and sports. Further, it played a major role in shaping public opinion during the 1950s. By the mid-1960s, color broadcasting was introduced, marking a prominent milestone in the progress of TV technology."
    },
    "fish.txt": {
        "type": "file",
        "path": "TestDirectory3/fish.txt",
        "data": 1,
        "summary": "The document discusses the fascinating world of fishes. These aquatic beings, marked by gills and swimming fins, can be classified into the primitive jawless fish and the more widespread jawed fish, which encompasses all living cartilaginous and bony fish. Interestingly, fish can communicate acoustically, especially during courtship displays. The text traces the evolution of fish from the earliest Cambrian filter feeders to the diversity of forms we see today. It highlights the emergence of ostracoderms, the earliest fish with dedicated respiratory gills and paired fins, and later the placoderms, the pioneers amongst fishes with jaws."
    },
    "bird.txt": {
        "type": "file",
        "path": "TestDirectory3/test1/bird.txt",
        "data": 1,
        "summary": "The text provides insights into the world of birds, warm-blooded vertebrates known for their feathers, toothless beaked jaws, hard-shelled eggs, high metabolic rate, and lightweight yet robust skeleton. With over 11,000 living species varying greatly in size, birds can be found in every corner of the globe. Notably, birds possess wings, modified forelimbs that bestowed upon them the gift of flight. Interestingly, there are species which have lost this ability through evolution, such as ratites, penguins, and certain island species. Furthermore, bird species living in aquatic environments have further adaptations for their lifestyle."
    },
    "apple.txt": {
        "type": "file",
        "path": "TestDirectory3/test1/apple.txt",
        "data": 1,
        "summary": "This file shares a deep-rooted account of apples. Originating from Central Asia, apples are a fruit borne by the Malus tree, which are now grown extensively throughout the world. Apple trees, notably, yield fruit that can greatly differ from their parent when grown from seed. Thus, for maintaining desired traits, clonal grafting onto rootstocks is used in commercial and other crucial cultivations. Interestingly, apples hold a significant place across various cultures, from Norse to Greek to European Christian traditions."
    },
    "dog.txt": {
        "type": "file",
        "path": "TestDirectory3/test2/dog.txt",
        "data": 1,
        "summary": "The document discusses dogs, domesticated descendants of wolves, and the first species to be domesticated more than 14,000 years ago. Dogs have been selectively bred for desired behaviors, sensory capabilities, and physical attributes, resulting in a wide range of breeds varying in shape, size, and color. Despite having inferior visual acuity compared to humans, dogs have a superior sense of smell and an expansive olfactory cortex. Due to their long association with humans, dogs have adapted to a starch-rich diet and play multiple roles in human societies, showcasing their multifaceted partnership with us."
    },
    "lemon.txt": {
        "type": "file",
        "path": "TestDirectory3/test2/lemon.txt",
        "data": 1,
        "summary": "The document delves into the details of lemons, a citrus species native to Asia. The lemon tree is an evergreen, producing yellow, oval-shaped fruits widely known for their juice, which features prominently in various drinks and foods, thanks to its sour taste from the 5-6% citric acid content. The pulp and rind also find uses in cooking and baking. Interestingly, the aesthetic appeal of lemons has found it a place in art since ancient Egyptian times. The document also notes that as of 2022, India led world lemon production, contributing 18% to a total yield of 22 million tonnes."
    }
}